[{
    "overview": [
        "Experience in all facets of the Software Development Life Cycle, from planning and requirements documentation through development, implementation, deployment, and maintenance.",
        "Expert-level Javascript background, with heavy experience creating ExtJS and Sencha Touch applications.",
        "Very strong Java knowledge, including accreditation as a Sun Certified Java Programmer (SCJP) for Java 5.",
        "Experience creating platform-independent mobile applications using Sencha Touch and Apache Cordova (PhoneGap).",
        "Independent, analytical thinker with strong problem-solving skills and a history of impressing with outside-the-box thinking and superb efficiency."
    ],

    "skills": [
        {
            "category": "Languages",
            "values": [
                "Javascript",
                "ExtJS",
                "AngularJS",
                "CSS/SASS/Fashion",
                "Java",
                "JSP"
            ]
        },
        {
            "category": "Frameworks/Libraries",
            "values": [
                "ExtJS",
                "Sencha Touch",
                "Spring Framework",
                "Spring Security",
                "Hibernate",
                "Apache Cordova (PhoneGap)",
                "Guava (Google Collections)",
                "Log4J",
                "Ant",
                "Maven",
                "Jasper Reports",
                "Jackson JSON",
                "Apache Commons libraries",
                "Velocity"
            ]
        },
        {
            "category": "Software",
            "values": [
                "IntelliJ IDEA",
                "Eclipse",
                "Firebug & Webkit debugging",
                "GIMP Image Editor",
                "JBoss Application Server",
                "Tomcat"
            ]
        },
        {
            "category": "Other",
            "values": [
                "SVN",
                "JIRA",
                "JavaMelody",
                "Web Services",
                "Agile Software Development Process"
            ]
        },
        {
            "category": "Also Familiar With",
            "values": [
                "JSP",
                "JSF",
                "RichFaces",
                "XSLT",
                "C#",
                "C++",
                "Perl",
                "ASP.NET",
                "PHP",
                "Shell Scripting",
                "JBoss SEAM",
                "Struts",
                "DynamicReports Library",
                "Visual Studio .NET",
                "Weblogic"
            ]
        }
    ],

    "experience": [
        {
            "company": "Virtual Instruments",
            "from": "January 2014",
            "to": "present",
            "location": "San Jose, CA (telecommuting from Charlotte, NC)",
            "phone": "",
            "position": "Senior Software Engineer",
            "overview": "Senior UI developer working on ExtJS 5.1 application called VirtualWisdom (VW). Also building Sencha Touch 2.3 application from scratch as a mobile companion (both web and native) for the main application.",
            "details": [
                "Rapidly integrated into UI team as a power ExtJS user, teaching new techniques and mentoring other developers about ExtJS best-practices.",
                "Coordinated major overhaul of existing codebase to refactor into proper Sencha-recommended MVC architecture, and for better performance, maintenance, and readability",
                "Reorganized ordinary CSS stylesheets into a new SASS-based theme, integrating the stylesheet compilation into the app's Maven build",
                "Architected a proof-of-concept for prototype of mobile version of app using Sencha Touch 2.3",
                "Assisted in directing the upgrade of the product from ExtJS 4.2.1 to ExtJS 5.1.0, while ultimately keeping ExtJS 6.0 and a universal application as the end goal",
                "Implemented a complex custom routing solution with ExtJS 4.2.1, and migrated to the new built-in framework routing after upgrading to ExtJS 5.1.0.",
                "Bootstrapped and maintained automated testing for UI using Siesta framework"
            ]
        },
        {
            "company": "Bank of America",
            "from": "March 2013",
            "to": "January 2014",
            "location": "Charlotte, NC",
            "phone": "",
            "position": "Senior Software Contractor",
            "overview": "Served as Subject Matter Expert (SME), providing expertise, mentoring, and development in ExtJS for an internal Risk Technologies tool.",
            "details": [
                "Upgraded application from ExtJS 4.0.7 to ExtJS 4.1.3.",
                "Assisted in design and development for various ExtJS components.",
                "Designed and developed screens for query builder and results, to allow for dynamically selecting data based on criteria, displaying the data results, and modifying/submitting/deleting the data.",
                "Mentored on-site and offshore resources in best-practices for ExtJS."
            ]
        },
        {
            "company": "Aym Technologies",
            "from": "September 2011",
            "to": "March 2013",
            "location": "Charlotte, NC",
            "phone": "(704) 343-9688",
            "position": "Technical Lead/Architect",
            "overview": "Architected and built a software-as-a-service (SaaS) application called OnTarget Clinical (OTC) from infancy to production. As the tech lead of a team of two, I oversaw the entire product lifecycle of the application. The system was based on an existing .NET application, but was built from scratch entirely using Spring, Hibernate, and ExtJS.",
            "details": [
                "Designed multi-tenancy system for OTC using Spring Security.",
                "Used ExtDirectSpring to allow for easy connection between Spring backend and ExtJS UI.",
                "Created a metadata-based search and sort mechanism for quick, intuitive, and reusable data access layer using custom-made annotations, ExtDirectSpring and Hibernate Criteria queries.",
                "Designed and maintained build system for managing application versioning, including using Sencha Command to package and optimize javascript application.",
                "Created an Ad Hoc Reporting system, using DynamicReports library with Jasper Reports to allow users to configure data sets for customized reports."
            ]
        },
        {
            "company": "Companion Cabinet Software (now Breakfront)",
            "from": "November 2008",
            "to": "September 2011",
            "location": "Charlotte, NC",
            "phone": "",
            "position": "Senior Software Developer",
            "overview": "Worked on teams with 1-5 engineers on cloud-based software service for Cabinet Dealers designed to streamline the entire sales process, from CRM capabilities, to quoting, pricing, purchasing, and receiving.",
            "details": [
                "Quickly integrated into a team of 5 developers, becoming a valuable resource for Java, Javascript, and CSS knowledge.",
                "Developed app using JBoss SEAM back-end, with Hibernate as the persistence framework.",
                "Took the lead on several release efforts, organizing project tasks and release timetables, and serving as lead developer.",
                "Converted a slower, JSF-based front-end to a faster, more dynamic interface using ExtJS. The application was loaded using a single HTML page, and the DOM was then built using an object-oriented UI built on extended ExtJS components.",
                "Created many plugins for ExtJS to allow for custom Javascript components that could be reused throughout the application.",
                "Worked on team of 2 with manager to create a separate webapp for catalog management, also using SEAM platform with a dynamic ExtJS interface.",
                "Used Ant to design build process that combined Javascript and CSS files into single, compressed, minified file, allowing for development of separate, modularized .js files.",
                "Created new custom JSF tags, and simplified existing code into reusable custom tags."
            ]
        },
        {
            "company": "ACN, Inc.",
            "from": "August 2008",
            "to": "November 2008",
            "location": "Concord, NC",
            "phone": "(704) 260-3226",
            "position": "Senior Software Developer",
            "overview": "Worked on internal application that managed sales representatives and assisted with help desk inquiries.",
            "details": [
                "Developed for JBoss Application Server with a Struts-based front-end.",
                "Quickly learned and began developing Oracle PL-SQL scripts to improve backend performance"
            ]
        },
        {
            "company": "Solers, Inc.",
            "from": "January 2005",
            "to": "August 2008",
            "location": "Arlington, VA",
            "phone": "(703) 526-0001",
            "position": "Software Engineer",
            "overview": "Developer in Enterprise Services (ES) department of Net-Centric Systems Division (NCSD); selected by management to be trained as an Integrated Project Team (IPT) Lead",
            "details": [
                "Led development effort for Battle Command Battle Lab (BCBL) Information Exchange Manager (IEM), using Java to extract information from an LDAP server to configure a Net-Centric Enterprise Services (NCES) compliant messaging channel.",
                "Redesigned and implemented NCES Federated Search portlet using AJAX technology to obtain dynamic, asynchronous search results.",
                "Redesigned and implemented NCES Messaging portlet to migrate from a traditional JSP portlet into a dynamic, AJAX-based messaging inbox.",
                "Assisted in creating web service clients for NCES web services with Apache Axis and mock clients used for internal testing.",
                "Created an extension to Apache Lucene to index and search directories using a database schema rather than the Lucene default file-based indexing."
            ]
        },
        {
            "company": "General Electric (GE Energy)",
            "from": "May 2004",
            "to": "August 2004",
            "location": "Salem, VA",
            "phone": "(540) 387-7000",
            "position": "Software Engineering Intern",
            "overview": "Worked on Windows application to fully support a turbine engine. Developed code using C# and ASP .NET."
        }
    ],

    "education": [
        {
            "school": "Virginia Tech",
            "location": "Blacksburg, VA",
            "finished": "December 2004",
            "diploma": "B.S., Honors Scholar Diploma, Magna Cum Laude",
            "major": "Computer Engineering",
            "minors": [
                "Spanish",
                "Business Leadership"
            ]
        }
    ]
}]